/**
 * --------------------------------前言-------------------------------------
 * 
 * 现在是做java开发的小白，大学的时候学过数据结构，感觉不重要，但在考研的时候，仔细
 * 地看了一遍，突然发现数据结构很神奇，那个时候认为能够看懂数据结构是一种成长。同时在
 * 备考的时候，写的都是伪代码，伪代码写好了就能够得到一定的分数，也能顺利的考上研究生。
 * 但是在生产环境下，计算机上运行的程序不可以是伪代码，就是能够跑起来的程序。
 * 
 * 开始自己骄傲的认为，学习过数据结构能够写出优质的代码，但是自己的水平还是停留在原来
 * 的地方。深刻的体会到，想要真正的提高，必须要把数据接口的代码要从头到尾实现一遍。从
 * 目前来看，网上已经有很多的实现方式了，最出名的当属高一凡老师《数据结构算法实现及解析》。
 * 
 * 从我目前的水平来看，跳跃太大了，而且当时在考研阶段，没那么多时间仔细研读。想要彻底的
 * 理解数据结构的里面所有原理，熟练掌握源码是必须的。所以，我要以身试法，自己整理一份完
 * 全的数据结构源码，用我浅显的水平实现。让大家能够快速掌握，等大家阅读完我代码后，并且
 * 感觉我写的这些东西不过如此，那么此时可以看高一凡老师的源码，再学习一边。我想这样能够
 * 大幅度提升自己的编码能力。
 * 
 * 我做过MCU，Java开发，在一般的场景下，我能够胜任，因为业务都比较简单，要么是首先定义
 * 哪个引脚，然后对其进行赋值，要么就是Java中的PO和VO转换，然后将数据库获取到的数据映射
 * 成对象。
 * 
 * 尤其是Java，大部分的底层功能都被实现了，只要自己知道有这么个东西，然后就是调
 * 用。高级一点的就是熟练使用工具，知道众多的框架，比如spring，mybatis，对于出现的问题，
 * 我们应该拿什么工具处理。还有一个就是，在大多数情况下如果数据读取较慢时候，都是加缓存。
 * 
 * 写代码写到现在，骄傲的认为我是一个研究生，然后我是一个软件工程师。这个骄傲是给谁看的呢，
 * 还是自己骗自己。能作为一个称职的软件工程师吗，大部分的代码都是调用，调过来，调过去。所以越
 * 来越发现自己就是一个农民工， 强迫自己学习。那么先从这个数据结构源码开始吧。
 * 
 * 前途要死磕的话，是一片渺茫。但是自己不看前途，看自己掌握了什么原理，能够实现什么价值。没有
 * 掌握的，不能实现的，从现在开始去掌握，去实现。我认为我就可以和你一样能够达到自己的阶段目标。
 * 
 * 
 * 
 * 开发工具使用vs code，编译环境GCC，调式使用GDB
 * vs code 可以在linux，mac，windows都可以免费下载使用。不用担心版权问题。
 * 
 * 
 * email:
 * 博客地址：
 * github:
 */ 

#include <stdio.h>
#include <stdlib.h>



int main()
{
    
    return 0;
}
